// Напишите программу, которая на вход принимает трехзначное числе, а на выходе показывает его последнюю цифру.
Console.WriteLine("Введите трехзначное число ");
int a = int.Parse(Console.ReadLine());
System.Console.WriteLine(a % 10);
