//Задача на нахождение квадратного корня числа а
Console.WriteLine("Введите число ");
int a = int.Parse(Console.ReadLine());
Console.WriteLine (a*a);
